Duet3D/RepRapFirmware/src/atmel/SAME54_DFP/1.1.134/atdf/ATSAME54P20A.atdf
        <register name="RANDSEED" offset="0x84" rw="RW" size="4" initval="0x00000000" caption="Random Seed">
        </register>
      </register-group>
      <value-group name="AES_CTRLA__AESMODE">
        <value name="ECB" caption="Electronic code book mode" value="0x0"/>
        <value name="CBC" caption="Cipher block chaining mode" value="0x1"/>
        <value name="OFB" caption="Output feedback mode" value="0x2"/>
        <value name="CFB" caption="Cipher feedback mode" value="0x3"/>
        <value name="COUNTER" caption="Counter mode" value="0x4"/>
        <value name="CCM" caption="CCM mode" value="0x5"/>
        <value name="GCM" caption="Galois counter mode" value="0x6"/>
      </value-group>
      <value-group name="AES_CTRLA__CFBS">
        <value name="128BIT" caption="128-bit Input data block for Encryption/Decryption in Cipher Feedback mode" value="0x0"/>
        <value name="64BIT" caption="64-bit Input data block for Encryption/Decryption in Cipher Feedback mode" value="0x1"/>
        <value name="32BIT" caption="32-bit Input data block for Encryption/Decryption in Cipher Feedback mode" value="0x2"/>
        <value name="16BIT" caption="16-bit Input data block for Encryption/Decryption in Cipher Feedback mode" value="0x3"/>
        <value name="8BIT" caption="8-bit Input data block for Encryption/Decryption in Cipher Feedback mode" value="0x4"/>
      </value-group>
      <value-group name="AES_CTRLA__CIPHER">
        <value name="DEC" caption="Decryption" value="0x0"/>
        <value name="ENC" caption="Encryption" value="0x1"/>
      </value-group>
      <value-group name="AES_CTRLA__KEYGEN">
        <value name="NONE" caption="No effect" value="0x0"/>
        <value name="LAST" caption="Start Computation of the last NK words of the expanded key" value="0x1"/>
      </value-group>
      <value-group name="AES_CTRLA__KEYSIZE">
        <value name="128BIT" caption="128-bit Key for Encryption / Decryption" value="0x0"/>
        <value name="192BIT" caption="192-bit Key for Encryption / Decryption" value="0x1"/>
        <value name="256BIT" caption="256-bit Key for Encryption / Decryption" value="0x2"/>
      </value-group>
      <value-group name="AES_CTRLA__LOD">
        <value name="NONE" caption="No effect" value="0x0"/>
        <value name="LAST" caption="Start encryption in Last Output Data mode" value="0x1"/>
      </value-group>
      <value-group name="AES_CTRLA__STARTMODE">
        <value name="MANUAL" caption="Start Encryption / Decryption in Manual mode" value="0x0"/>
        <value name="AUTO" caption="Start Encryption / Decryption in Auto mode" value="0x1"/>
      </value-group>
      <value-group name="AES_CTRLA__XORKEY">
        <value name="NONE" caption="No effect" value="0x0"/>
        <value name="XOR" caption="The user keyword gets XORed with the previous keyword register content." value="0x1"/>
      </value-group>
    </module>
    <module name="CAN" id="U2003" version="3.2.1" caption="Control Area Network">
      <register-group name="CAN" caption="Control Area Network">
        <register name="CREL" offset="0x0" rw="R" size="4" initval="0x32100000" caption="Core Release">
          <bitfield name="SUBSTEP" caption="Sub-step of Core Release" mask="0xF00000"/>
          <bitfield name="STEP" caption="Step of Core Release" mask="0xF000000"/>
          <bitfield name="REL" caption="Core Release" mask="0xF0000000"/>
        </register>
        <register name="ENDN" offset="0x4" rw="R" size="4" initval="0x87654321" caption="Endian">
          <bitfield name="ETV" caption="Endianness Test Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="MRCFG" offset="0x8" rw="RW" size="4" initval="0x00000002" caption="Message RAM Configuration">
          <bitfield name="QOS" caption="Quality of Service" mask="0x3" values="CAN_MRCFG__QOS"/>
        </register>
        <register name="DBTP" offset="0xC" rw="RW" size="4" initval="0x00000A33" caption="Fast Bit Timing and Prescaler">
          <bitfield name="DSJW" caption="Data (Re)Synchronization Jump Width" mask="0xF"/>
          <bitfield name="DTSEG2" caption="Data time segment after sample point" mask="0xF0"/>
          <bitfield name="DTSEG1" caption="Data time segment before sample point" mask="0x1F00"/>
          <bitfield name="DBRP" caption="Data Baud Rate Prescaler" mask="0x1F0000"/>
          <bitfield name="TDC" caption="Tranceiver Delay Compensation" mask="0x800000"/>
        </register>
        <register name="TEST" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Test">
          <bitfield name="LBCK" caption="Loop Back Mode" mask="0x10"/>
          <bitfield name="TX" caption="Control of Transmit Pin" mask="0x60" values="CAN_TEST__TX"/>
          <bitfield name="RX" caption="Receive Pin" mask="0x80"/>
        </register>
        <register name="RWD" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="RAM Watchdog">
          <bitfield name="WDC" caption="Watchdog Configuration" mask="0xFF"/>
          <bitfield name="WDV" caption="Watchdog Value" mask="0xFF00"/>
        </register>
        <register name="CCCR" offset="0x18" rw="RW" access="WSYNC" size="4" initval="0x00000001" caption="CC Control">
          <bitfield name="INIT" caption="Initialization" mask="0x1"/>
          <bitfield name="CCE" caption="Configuration Change Enable" mask="0x2"/>
          <bitfield name="ASM" caption="ASM Restricted Operation Mode" mask="0x4"/>
          <bitfield name="CSA" caption="Clock Stop Acknowledge" mask="0x8"/>
          <bitfield name="CSR" caption="Clock Stop Request" mask="0x10"/>
          <bitfield name="MON" caption="Bus Monitoring Mode" mask="0x20"/>
          <bitfield name="DAR" caption="Disable Automatic Retransmission" mask="0x40"/>
          <bitfield name="TEST" caption="Test Mode Enable" mask="0x80"/>
          <bitfield name="FDOE" caption="FD Operation Enable" mask="0x100"/>
          <bitfield name="BRSE" caption="Bit Rate Switch Enable" mask="0x200"/>
          <bitfield name="PXHD" caption="Protocol Exception Handling Disable" mask="0x1000"/>
          <bitfield name="EFBI" caption="Edge Filtering during Bus Integration" mask="0x2000"/>
          <bitfield name="TXP" caption="Transmit Pause" mask="0x4000"/>
          <bitfield name="NISO" caption="Non ISO Operation" mask="0x8000"/>
        </register>
