Duet3D/RepRapFirmware/src/atmel/SAME54_DFP/1.1.134/atdf/ATSAME54P20A.atdf
      <value-group name="CCL_LUTCTRL__FILTSEL">
        <value name="DISABLE" caption="Filter disabled" value="0"/>
        <value name="SYNCH" caption="Synchronizer enabled" value="1"/>
        <value name="FILTER" caption="Filter enabled" value="2"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__INSEL0">
        <value name="MASK" caption="Masked input" value="0"/>
        <value name="FEEDBACK" caption="Feedback input source" value="1"/>
        <value name="LINK" caption="Linked LUT input source" value="2"/>
        <value name="EVENT" caption="Event input source" value="3"/>
        <value name="IO" caption="I/O pin input source" value="4"/>
        <value name="AC" caption="AC input source" value="5"/>
        <value name="TC" caption="TC input source" value="6"/>
        <value name="ALTTC" caption="Alternate TC input source" value="7"/>
        <value name="TCC" caption="TCC input source" value="8"/>
        <value name="SERCOM" caption="SERCOM input source" value="9"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__INSEL1">
        <value name="MASK" caption="Masked input" value="0x0"/>
        <value name="FEEDBACK" caption="Feedback input source" value="0x1"/>
        <value name="LINK" caption="Linked LUT input source" value="0x2"/>
        <value name="EVENT" caption="Event input source" value="0x3"/>
        <value name="IO" caption="I/O pin input source" value="0x4"/>
        <value name="AC" caption="AC input source" value="0x5"/>
        <value name="TC" caption="TC input source" value="0x6"/>
        <value name="ALTTC" caption="Alternate TC input source" value="0x7"/>
        <value name="TCC" caption="TCC input source" value="0x8"/>
        <value name="SERCOM" caption="SERCOM input source" value="0x9"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__INSEL2">
        <value name="MASK" caption="Masked input" value="0x0"/>
        <value name="FEEDBACK" caption="Feedback input source" value="0x1"/>
        <value name="LINK" caption="Linked LUT input source" value="0x2"/>
        <value name="EVENT" caption="Event input source" value="0x3"/>
        <value name="IO" caption="I/O pin input source" value="0x4"/>
        <value name="AC" caption="AC input source" value="0x5"/>
        <value name="TC" caption="TC input source" value="0x6"/>
        <value name="ALTTC" caption="Alternate TC input source" value="0x7"/>
        <value name="TCC" caption="TCC input source" value="0x8"/>
        <value name="SERCOM" caption="SERCOM input source" value="0x9"/>
      </value-group>
    </module>
    <module name="CMCC" id="U2015" version="6.0.0" caption="Cortex M Cache Controller">
      <register-group name="CMCC" caption="Cortex M Cache Controller">
        <register name="TYPE" offset="0x0" rw="R" size="4" access-size="4" initval="0x000012D2" caption="Cache Type Register">
          <bitfield name="GCLK" caption="dynamic Clock Gating supported" mask="0x2"/>
          <bitfield name="RRP" caption="Round Robin Policy supported" mask="0x10"/>
          <bitfield name="WAYNUM" caption="Number of Way" mask="0x60" values="CMCC_TYPE__WAYNUM"/>
          <bitfield name="LCKDOWN" caption="Lock Down supported" mask="0x80"/>
          <bitfield name="CSIZE" caption="Cache Size" mask="0x700" values="CMCC_TYPE__CSIZE"/>
          <bitfield name="CLSIZE" caption="Cache Line Size" mask="0x3800" values="CMCC_TYPE__CLSIZE"/>
        </register>
        <register name="CFG" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000020" caption="Cache Configuration Register">
          <bitfield name="ICDIS" caption="Instruction Cache Disable" mask="0x2"/>
          <bitfield name="DCDIS" caption="Data Cache Disable" mask="0x4"/>
          <bitfield name="CSIZESW" caption="Cache size configured by software" mask="0x70" values="CMCC_CFG__CSIZESW"/>
        </register>
        <register name="CTRL" offset="0x8" rw="W" size="4" access-size="4" initval="0x00000000" caption="Cache Control Register">
          <bitfield name="CEN" caption="Cache Controller Enable" mask="0x1"/>
        </register>
        <register name="SR" offset="0xC" rw="R" size="4" access-size="4" initval="0x00000000" caption="Cache Status Register">
          <bitfield name="CSTS" caption="Cache Controller Status" mask="0x1"/>
        </register>
        <register name="LCKWAY" offset="0x10" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Cache Lock per Way Register">
          <bitfield name="LCKWAY" caption="Lockdown way Register" mask="0xF"/>
        </register>
        <register name="MAINT0" offset="0x20" rw="W" size="4" access-size="4" initval="0x00000000" caption="Cache Maintenance Register 0">
          <bitfield name="INVALL" caption="Cache Controller invalidate All" mask="0x1"/>
        </register>
        <register name="MAINT1" offset="0x24" rw="W" size="4" access-size="4" initval="0x00000000" caption="Cache Maintenance Register 1">
          <bitfield name="INDEX" caption="Invalidate Index" mask="0xFF0"/>
          <bitfield name="WAY" caption="Invalidate Way" mask="0xF0000000" values="CMCC_MAINT1__WAY"/>
        </register>
        <register name="MCFG" offset="0x28" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Cache Monitor Configuration Register">
          <bitfield name="MODE" caption="Cache Controller Monitor Counter Mode" mask="0x3" values="CMCC_MCFG__MODE"/>
        </register>
        <register name="MEN" offset="0x2C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Cache Monitor Enable Register">
          <bitfield name="MENABLE" caption="Cache Controller Monitor Enable" mask="0x1"/>
        </register>
        <register name="MCTRL" offset="0x30" rw="W" size="4" access-size="4" initval="0x00000000" caption="Cache Monitor Control Register">
          <bitfield name="SWRST" caption="Cache Controller Software Reset" mask="0x1"/>
        </register>
        <register name="MSR" offset="0x34" rw="R" size="4" access-size="4" initval="0x00000000" caption="Cache Monitor Status Register">
          <bitfield name="EVENT_CNT" caption="Monitor Event Counter" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="CMCC_TYPE__CLSIZE">
        <value name="CLSIZE_4B" caption="Cache Line Size is 4 bytes" value="0"/>
        <value name="CLSIZE_8B" caption="Cache Line Size is 8 bytes" value="1"/>
        <value name="CLSIZE_16B" caption="Cache Line Size is 16 bytes" value="2"/>
        <value name="CLSIZE_32B" caption="Cache Line Size is 32 bytes" value="3"/>
        <value name="CLSIZE_64B" caption="Cache Line Size is 64 bytes" value="4"/>
        <value name="CLSIZE_128B" caption="Cache Line Size is 128 bytes" value="5"/>
      </value-group>
      <value-group name="CMCC_TYPE__CSIZE">
        <value name="CSIZE_1KB" caption="Cache Size is 1 KB" value="0"/>
        <value name="CSIZE_2KB" caption="Cache Size is 2 KB" value="1"/>
        <value name="CSIZE_4KB" caption="Cache Size is 4 KB" value="2"/>
        <value name="CSIZE_8KB" caption="Cache Size is 8 KB" value="3"/>
        <value name="CSIZE_16KB" caption="Cache Size is 16 KB" value="4"/>
        <value name="CSIZE_32KB" caption="Cache Size is 32 KB" value="5"/>
        <value name="CSIZE_64KB" caption="Cache Size is 64 KB" value="6"/>
      </value-group>
      <value-group name="CMCC_TYPE__WAYNUM">
        <value name="DMAPPED" caption="Direct Mapped Cache" value="0"/>
        <value name="ARCH2WAY" caption="2-WAY set associative" value="1"/>
        <value name="ARCH4WAY" caption="4-WAY set associative" value="2"/>
      </value-group>
